# Brewfile — install everything with: brew bundle --file=Brewfile

# --- Terminal / shell / editor ---
cask "ghostty"                          # terminal emulator
brew "fish"                             # shell
brew "neovim"                           # editor
cask "font-jetbrains-mono-nerd-font"    # icon font (Nerd Font)

# --- Prompt + CLI tools ---
brew "starship"                         # prompt
brew "zoxide"                           # smarter cd
brew "eza"                              # modern ls
brew "bat"                              # cat with colors
brew "fzf"                              # fuzzy finder
brew "ripgrep"                          # fast grep (used by nvim/telescope)
brew "fd"                               # fast find
brew "lazygit"                          # git TUI

# --- Code quality ---
brew "openjdk@21"                       # Java runtime (for the SonarLint LS)
brew "sonar-scanner"                    # local analysis against SonarQube
# The SonarQube server runs in Docker, see README

# --- Misc ---
brew "gh"                               # GitHub CLI
brew "git"
